package org.example;

public class Arrays {

//  public static void main(String[] args) {
//   Создать двумерный массив 5х8 типа int и инициализировать его с помощью блока для инициализации.  Найти максимальное и минимальное значение в каждой "строке" и записать эти значения в двухмерный массив 5х2.
//    int [][] arr = {
//        {5, 6, 8, 1, 9, -12, -68, 99},
//        {100, 15, -45, -8, 8, 5, 6},
//        {666, -88, 12, 78, -100, -5},
//        {999, 55, -77, -222, -5, 8, 3, -7},
//        {666, -88, 12, 78, -100, -5}
//    };
//
//    Создать двумерный массив типа char размером 4х2. Записать в него значения с помощью блока для инициализации.Распечатать значения массива.
//    char [][] arr = {
//        {'a', 'b'},
//        {'c', 'd'},
//        {'e', 'f'},
//        {'g', 'h'}
//    };
//    for(int i=0; i<arr.length; i++){
//      for(int j=0; j<arr[0].length; j++){
//        System.out.print(arr[i][j] + " ");
//      }
//      System.out.println();
//    }
//    создать массив String размером 3х6, записать в него значения, Распечатать массив
//    char symbol = 'a';
//    int number = 1;
//    String [][] arr = new String[3][6];
//    for(int i = 0; i<arr.length; i++){
//      for(int j = 0; j<arr[0].length; j++){
//        arr[i][j] = symbol + "" + (j+1);
//        System.out.print(arr[i][j] + " ");
//      }
//      symbol++;
//      System.out.println();
//    }
//    Создать массив double, заполнить с помощью блока инициализации, вывести первый элемент
//    double [] arr = {569.52, -3654, 55555.598};
//    System.out.println("First element is " + arr[0]);
//    Создать массив, заполнить элементами, вывести последний элемент
//    String[] arr = new String [7];
//    arr[0] = "Monday";
//    arr[1] = "Tuesday";
//    arr[2] = "Wednesday";
//    arr[3] = "Thursday";
//    arr[4] = "Friday";
//    arr[5] = "Saturday";
//    arr[6] = "Sunday";
//    System.out.println("Last element is " + arr[arr.length-1]);
//  }
}
